package org.demo;

/**
 * 782. 变为棋盘
 * 
 * 一个 n x n 的二维网络 board 仅由 0 和 1 组成 。每次移动，你能任意交换两列或是两行的位置。
 * 返回 将这个矩阵变为  “棋盘”  所需的最小移动次数 。如果不存在可行的变换，输出 -1。
 * “棋盘” 是指任意一格的上下左右四个方向的值均与本身不同的矩阵。
 *     i 1.board[1][]<->board[2][]   2.board[][2]<->board[][3] 
 * j [[0,1,1,0],	[[0,1,1,0],		[[0,1,0,1],
 *    [0,1,1,0], 	 [1,0,0,1],		 [1,0,1,0],
 *    [1,0,0,1],	 [0,1,1,0],      [0,1,0,1],
 *    [1,0,0,1]]	 [1,0,0,1]]      [1,0,1,0]]
 */
public class Q782 {
	
	
	public static void main(String[] args) {
		int[][] board = new int[][] {{0,1,1,0},{0,1,1,0},{1,0,0,1},{1,0,0,1}};
		int length = board.length;
		for(int i=0;i<length-1;i++) {
			
		}		
	}
}
